{
  "result": "success",
  "what-license-is-this-project?": "The license is GPLv3",
  "why-is-this-important?": "If the Logro microservices architecture becomes popular, and others use as many databases as I do, then they will need tools to manage that data. If it is only me working on the project, then I need the same tools. It is very cruical to build tools to manage other tools, and this project is an example of that concept.",
  "the-problem": "Having multiple databases for multiple microservices requires a service in and of itself.",
  "limitations": "Working with multiple databases means that some of the REST endpoints are unrefined. Many could be improved with more time and care, but many more endpoints could be written. The most exciting and needed enpoints have been included when needed to perform some other vital function of the Logro microservices architecture.",
  "solutions": "The processes that exist currently allow for moving data between the neo4j and mongo databases. Moreover, the databases are both accessed by other microservices, and can now work with this service and others in tandum.",
  "lessons-learned": "I've learned that some of these processes take much longer than I originally predicted. In fact, I think that many could be improved by someone with better database skills. I'm always wondering where the edge of my knowledge might be, and I'm excited to have found that, at least partially, in the database realm. I'd like to continue learning how to implement good ETL patterns.",
  "start-the-mongo-database": "mongod",
  "start-the-neo4j-database": " sudo /etc/init.d/neo4j-service start",
  "install-python-packages": "pip install -r requirements.txt",
  "run-the-app-in-development-mode": "python app/runserver.py 5000",
  "load-the-linguistic-corpora-into-neo4j.-located-in-/app/load/views.py": "# This loads the corpus data from mongo to neo4j\n    @load.route('/rEmotion_corpus/all', methods=['POST'])\n    def create_all_rEmotion_corpora():\n        return controllers.create_all_rEmotion_corpora()",
  "how-does-loading-processed-'affect-word'-similarity-data-work?": "These methods load the data, and on a high level all you need to know is that they take a long time to load (on the order of hours). As for a more detailed and nuanced explanation, the load methods call a variety of other extract and transform methods which are compartmentalized in their respective controllers and views. You *must* specify the mongo database name as a parameter, but beside that all of the other work is done for you. The list of R-EMOTION s is specified in the code, and these methods will process the 400 R-EMOTION s created by Nov 23, 2016.",
  "running-time-intensive-load-proccesses-from-neo4j-to-mongo.-located-in-/app/load/views.py": "# Load Order Similarities - Enriched Order Data for R-Emotion\n    @load.route('/rEmotion_corpus/order_similarity/<mongo_db_name>', methods=['POST'])\n    def create_enhanced_rEmotion_corpora(mongo_db_name=None):\n        return controllers.create_enhanced_rEmotion_corpora(mongo_db_name=mongo_db_name)\n\n    # This loads the graph operated data from neo4j to MongoDB\n    @load.route('/rEmotion_corpus/frequency_dist/<mongo_db_name>', methods=['POST'])\n    def create_affect_word_frequency_distribution(mongo_db_name=None):\n        return controllers.create_affect_word_frequency_distribution(mongo_db_name=mongo_db_name)",
  "the-database-connections-are-set-in-/app/config/databases.py.-you-ought-to-change-these-to-suit-your-needs.": "## Connect to default instance of neo4j\n    secure_graph1 = Graph(\"http://neo4j:admin@0.0.0.0:7474/db/data/\")  "
}
