{
  "result": "success",
  "what-license-is-this-project?": "The license is GPLv3",
  "why-is-this-important?": "On a personal level, this was the first application I was able to successfully deploy to a cloud hosting service. On a more general and societal level, my hope is that others will be able to use applications like this one to learn more about themselves. By allowing end users to reflect about their daily activities, the experience of taking notes about one's life should ultimately allow people to offload thoughts that might become distracting if unanswered.",
  "the-problem": "The purpose is to allow other people and myself to become more skeptical about our own emotions. This motivation is due to the explicit need to reflect that every human has, but at times does not serve. The problem is that sometimes it can be a challenge to recall coherent groups of reflections, and recall is a skill that computers have in abundance.",
  "limitations": "There are technical limitations that compound the difficulty of the problem. The MEAN stack, like any other monolithic application has issue with scale. It is also quite a large stack, so there is a steep learning curve. For example, as soon as I started getting a grasp of one piece of the code, I realized that my understanding of another piece was incomplete. Ultimately, I was able to build software that allows the user to do a little introspection through a journaling process.",
  "solutions": "There is a concept of an activity, experience, and log hierarchy. Every experience is the intersection of two activities, and every experience can have a set of logs. An activity can also be associated with any number of experiences.",
  "lessons-learned": "Among many things, I realized that the limitations of the MEAN stack mentioned above prevented me from building a set of tools. As a result, I've started learning other programming languages. Therefore, instead of building just one big tool, I've decided to build many smaller tools. Like a mega-toaster that also makes breakfast and pours orange juice, the MEAN stack by itself would have been too cumbersome. Additionally as an alpha state of a microservices project called Logro, this app attempts to address the attention deficit humans have in achieving self-actualization. It provides a basic framework that additionally can be tailored by end users. Logro is a set of tools to provide visualizations and other information about the user's attention with an aim to aid in reaching self-actualization. I've learned about a cross-disciplinary array of subjects to hone in on the concept of self-actualization. I've also learned how to bring together computers and sub-fields of cognitive psychology since building the initial pieces of evgroio by studying what's called affective computing. Logro is a project that makes use of natural language processing, affect computing, and other techniques for analyzing humans. Ultimately, I've developed a systematized process of learning and growing so that I am more versatile and adaptable - it mainly consists of a combination of short-term (concrete) planning that supersedes long-term planning (abstract)."
}
