{
  "result": "success",
  "what-license-is-this-project?": "The license is GPLv3",
  "what-is-affect?": "Affect is the measurable observation of an emotion. Affects are defined by the observed reality (via some kind of sign) of a person. Examples of affect are skin conductance, motion, speech, language and body temperature. This kind of objective data allows us to support and understand our subjective perception of our emotions. Furthermore, this kind of technology allows humans to better understand each other. The purpose is to allow other people and myself to become more skeptical about our own emotions. There is a concept of an activity, experience, and log hierarchy. Every experience is the intersection of two activities, and every experience can have a set of logs. An activity can also be associated with any number of experiences.",
  "why-is-this-important?": "Emotions play an essential role in perception, attention, rational decision making, and action selection. I strongly believe all the social sciences can benefit from systematic methods found in other empirical disciplines, and perhaps new kinds of fields can be created akin to affective computing. My thought is one where the kinds of analytics we get from emotive data can be used to communicate how we feel to those that matter the most to us, and while there are other use cases, I hope that the technology is used to continue to connect humanity.",
  "the-problem": "As a post alpha state of the so-called Logro project, the 'log-grower' app continues in the attempt to address the attention deficit humans have in achieving self-actualization. It provides a basic framework that additionally can be tailored by end users. Logro is a set of tools to provide visualizations and other information about the user's attention with an aim to aid in reaching self-actualization.",
  "limitations": "Every human needs to fulfill certain basic needs before they are able to deeply reflect on their own. This app has no technical or social requirement of solving those needs. It doesn't really handle other needs, and that's outside the scope.",
  "solutions": "Logro is a project that makes use of natural language processing, affect computing, and other techniques for analyzing humans. Within the scope of this project, Logro catalyzes the self-actualization process humans tend to have happen. Logro participates in that stigmergically occuring process. The log-grower microservice was originally based on the MEAN stack, and it is a content management user interface - generally speaking.",
  "install-bower-package-manager": "npm install -g bower",
  "install-grunt-task-runner": "npm install -g grunt-cli",
  "run-the-app-in-development-mode": "grunt",
  "install-npm-packages": "npm install",
  "install-bower-packages": "bower install",
  "example-of-a-data-visualization-directive": "<donut-chart-viz totals=\"{{experienceTotals}}\"></donut-chart-viz>",
  "how-does-integrating-angular-material-directives-for-the-mobile-version-work?": "After including the 'angular-material' dependency, log-grower can actually integrate its CSS and JavaScript. The following example is located in the file 'overview.client.view.html' and it shows how easy it is to use. I won't describe the documentation specifically, but the groups of tags that aren't standard HTML are actually angular directives. There is JavaScript that works with the tabs to trigger events on specific mobile events, that also enable mouse events. If you can understand this code, then you should have a good grasp on the entire 'log-grower' application.",
  "example-of-angular-material-tab.-located-in-/public/modules/reflection-place/viewss/overview.client.view.html": "<md-tab id=\"experiencesTabKeyFigures\">\n      <md-tab-label>Experience Statistics</md-tab-label>\n      <md-tab-body>\n        <div class=\"tabContentOverflow\" style=\"color: white;\">\n            <div style=\"text-align: center;\">\n              <donut-chart-viz totals=\"{{experienceTotals}}\"></donut-chart-viz>\n            </div>\n            <h5 class=\"well\" style=\"background: #BCBCBC; color: #222222; z-index: 0;\">Experience Stats</h5>\n            <div class=\"well\" style=\"background: #222222; color: #BCBCBC; z-index: 0;\">\n              <h6>\n                Of your {{experienceTotals.sumAll}} total experiences,\n                {{experienceTotals.sumPrivate}} are private. You decided\n                to share {{experienceTotals.sumPublic}}.\n              </h6>\n              <h6>\n                Of your {{experienceTotals.sumAll}} total experiences,<br>\n                a total of {{experienceTotals.sumBefore}} happen before an activity.<br>\n                a total of {{experienceTotals.sumWhile}} are during an activity.<br>\n                a total of {{experienceTotals.sumAfter}} occured after an activity.\n              </h6>\n            </div>\n        </div>\n      </md-tab-body>\n    </md-tab>"
}
