{
  "result": "success",
  "what-license-is-this-project?": "The license is GPLv3",
  "what-is-affect?": "Affect is the measurable observation of an emotion. Affects are defined by the observed reality (via some kind of sign) of a person. Examples of affect are skin conductance, motion, speech, language and body temperature. This kind of objective data allows us to support and understand our subjective perception of our emotions. Furthermore, this kind of technology allows humans to better understand each other.",
  "why-is-this-important?": "Emotions play an essential role in perception, attention, rational decision making, and action selection. I strongly believe all the social sciences can benefit from systematic methods found in other empirical disciplines, and perhaps new kinds of fields can be created akin to affective computing. My thought is one where the kinds of analytics we get from emotive data can be used to communicate how we feel to those that matter the most to us, and while there are other use cases, I hope that the technology is used to continue to connect humanity.",
  "the-problem": "The purpose of Logro, and by association 'studious-display', is to allow other people and myself to become more skeptical about our own emotions. There is a concept of an activity, experience, and log hierarchy. Every experience is the intersection of two activities, and every experience can have a set of logs. An activity can also be associated with any number of experiences.",
  "limitations": "While the project is also structured in a way that it can be used as a user interface for other projects, it is meant to be just that. It can display the useful insight independent of other software, but it needs a data source with a server providing it data.",
  "solutions": "After users interact and utilize 'log-grower', a project that creates raw data, 'studious-display' is meant to show that information in a a friendly and inviting way. By this process, the user should be able to have more introspective tools available to them.",
  "run-the-app-in-development-mode": "npm run start dev",
  "install-npm-packages": "npm install",
  "changing-the-development-ip-address-in-webpack.config.js": "if(process.argv[2] == 'dev'){\n      ip = '0.0.0.0';\n    }"
}
